[{"id":"31b53843-b4ff-4249-8660-0a16c03daf62","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"678b303d-d8b7-4796-8a3d-2b97213da873","pain_index":1,"name":"Executive Performance Deterioration Terror","description":"Deep existential fear that their declining energy and cognitive sharpness will expose them as no longer capable of peak leadership, threatening their core professional identity. This isn't just about feeling tired - it's about the terror of being 'found out' as past their prime in high-stakes situations where mental acuity directly impacts their authority and career trajectory.","deep_triggers":["Impostor syndrome amplification during energy crashes", "Professional identity threat when cognitive function wavers", "Competitive displacement anxiety from younger, more energetic peers", "Authority erosion fear when struggling to maintain executive presence", "Career mortality salience - recognizing finite high-performance window"],"examples":["'I blanked during the board presentation and could see them questioning my capability'", "'My 35-year-old VP seems sharper than me lately - that's terrifying'", "'What if they realize I'm not the powerhouse they hired anymore?'"],"approved_at":"2025-12-01T13:14:49.482851+00:00"}, 
 {"id":"ef17f44b-d3c0-42ce-93fc-35839f3ec077","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"678b303d-d8b7-4796-8a3d-2b97213da873","pain_index":2,"name":"Premium Investment Validation Desperation","description":"Crushing psychological need to prove their sophisticated, expensive health strategy is actually superior after being repeatedly burned by premium products that failed to deliver. They're caught between their identity as discerning health investors and the humiliating reality that their expensive choices haven't worked better than basic solutions.","deep_triggers":["Sunk cost fallacy compounding with each failed premium purchase", "Expert decision-maker identity under threat from poor health ROI", "Intellectual superiority complex challenged by supplement failures", "Financial competence questioned by expensive health disappointments", "Status anxiety about premium choices not delivering premium results"],"examples":["'I've spent $10K+ on the best supplements and feel worse than my assistant who takes drugstore vitamins'", "'How can I be crushing it in business but failing at basic health optimization?'", "'I research everything obsessively but keep making expensive mistakes with my health'"],"approved_at":"2025-12-01T13:14:49.482851+00:00"}, 
 {"id":"673a55f1-1bd0-4367-a88b-49542db09d77","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"678b303d-d8b7-4796-8a3d-2b97213da873","pain_index":3,"name":"Control Restoration Compulsion","description":"Obsessive, almost manic need to regain absolute control over their body's performance after experiencing unpredictable health issues that felt professionally catastrophic. Having built their success on controlling outcomes, their body's betrayal creates deep psychological distress and compulsive solution-seeking behavior.","deep_triggers":["Learned helplessness reversal - fighting against feeling powerless over health", "Control-based identity crisis when body doesn't respond to their commands", "Professional vulnerability exposure fear from unpredictable symptoms", "Agency reclamation drive after feeling betrayed by their body", "Systematic thinking applied desperately to chaotic health symptoms"],"examples":["'I can predict market trends but can't control when my stomach will betray me in meetings'", "'My body used to be reliable like my business systems - now it's chaos'", "'I need to systematize my health like I systematized everything else in my life'"],"approved_at":"2025-12-01T13:14:49.482851+00:00"}, 
 {"id":"edc5e8f2-69b8-4364-8225-4ef6c56583de","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"678b303d-d8b7-4796-8a3d-2b97213da873","pain_index":4,"name":"Scientific Sophistication Fatigue Syndrome","description":"Mental exhaustion and growing cynicism from being the person who always researches everything, yet still making expensive health mistakes despite their analytical approach. They're trapped between their identity as evidence-based decision makers and the reality that health optimization seems to defy their proven analytical methods.","deep_triggers":["Analysis paralysis from conflicting expert opinions creating decision fatigue", "Intellectual humility forced by health complexity beyond their expertise", "Research competence questioned by inability to decode optimal health solutions", "Expert dependency anxiety conflicting with their leadership autonomy", "Information overload creating cognitive burden in already overscheduled life"],"examples":["'I can analyze complex business data but can't figure out which gut health expert to trust'", "'I spend more time researching supplements than I do on strategic planning'", "'How can I lead a company but can't navigate basic health decisions?'"],"approved_at":"2025-12-01T13:14:49.482851+00:00"}, 
 {"id":"27498967-a5d2-4144-be1d-34754a38ff5f","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"678b303d-d8b7-4796-8a3d-2b97213da873","pain_index":5,"name":"Time Scarcity Optimization Pressure","description":"Intense psychological pressure to find the one perfect, comprehensive solution that eliminates all health decision-making from their mental bandwidth. The gap between their need for health optimization and their complete lack of time creates a desperate search for the 'holy grail' solution that can work without their ongoing attention.","deep_triggers":["Cognitive load reduction desperation in already overwhelmed mental space", "Perfectionism driving search for one ultimate solution rather than multiple good ones", "Time poverty anxiety about health maintenance competing with career demands", "Efficiency maximization compulsion applied to biological processes", "Decision fatigue avoidance in non-core expertise area"],"examples":["'I need health to be like my automated investment portfolio - set it and forget it'", "'I don't have bandwidth to manage a complex supplement routine on top of everything else'", "'There has to be one thing that just works without me having to think about it constantly'"],"approved_at":"2025-12-01T13:14:49.482851+00:00"}, 
 {"id":"589f1167-eac6-4d8e-9605-67af898ae448","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"678b303d-d8b7-4796-8a3d-2b97213da873","pain_index":6,"name":"Aging Executive Identity Crisis","description":"Deep fear that visible signs of declining vitality will signal to their professional network that they're past their prime, undermining their authority and competitive position. This isn't vanity - it's recognition that executive presence and perceived energy directly impact their ability to lead and compete in ageist professional environments.","deep_triggers":["Ageism anxiety in competitive professional environments favoring youth", "Vitality-based authority recognition that energy equals executive presence", "Professional mortality salience - finite career peak performance window", "Status preservation drive against age-related decline", "Competitive disadvantage fear from appearing less dynamic than peers"],"examples":["'I see how they look at executives who seem tired - like they're done'", "'Energy is currency in leadership - without it, I'm just another aging exec'", "'I need to out-energy people half my age to maintain my competitive edge'"],"approved_at":"2025-12-01T13:14:49.482851+00:00"}, 
 {"id":"6a3e883f-2cff-4c54-9ec8-5db1c173f1af","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"678b303d-d8b7-4796-8a3d-2b97213da873","pain_index":7,"name":"Professional Invincibility Maintenance Anxiety","description":"Compulsive psychological need to maintain the image and internal reality of being unstoppable, never showing weakness or vulnerability in demanding situations. Health issues threaten their carefully constructed invulnerable professional persona, creating desperate need for solutions that restore their superhuman self-image.","deep_triggers":["Invulnerability illusion preservation essential to leadership identity", "Strength-based professional persona threatened by health vulnerabilities", "Weakness concealment compulsion in competitive professional environment", "Superhuman self-concept challenged by normal human health limitations", "Professional mythology maintenance about their exceptional capabilities"],"examples":["'I'm the person who never gets sick, never cancels, never shows weakness - that's my brand'", "'My team needs to see me as invincible - health issues would shatter their confidence'", "'Admitting I'm struggling with energy feels like professional suicide'"],"approved_at":"2025-12-01T13:14:49.482851+00:00"}, 
 {"id":"fcf91db3-a90e-4dc2-9f85-6f58511eda0e","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"678b303d-d8b7-4796-8a3d-2b97213da873","pain_index":8,"name":"Elite Access Status Positioning Pressure","description":"Psychological compulsion to signal access to cutting-edge solutions that aren't available to typical consumers, using health choices as status markers in high-level professional and social circles. Their health strategy becomes part of their elite identity and networking currency, creating pressure to find increasingly exclusive solutions.","deep_triggers":["Status signaling through exclusive health access in elite professional circles", "In-group superiority maintenance through sophisticated health choices", "Exclusivity bias driving preference for rare or hard-to-access solutions", "Social capital creation through unique health optimization stories", "Elite identity validation through cutting-edge health investments"],"examples":["'I want to be the person who knows about the health solution no one else has heard of yet'", "'My health regimen should reflect my access to the best of everything'", "'This needs to be something I can talk about at executive dinners that impresses people'"],"approved_at":"2025-12-01T13:14:49.482851+00:00"}, 
 {"id":"c1e82604-b504-42ab-b9c8-04a7fb077ed1","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"faf5c581-0a78-4291-a5d6-68df043f2146","pain_index":1,"name":"Intellectual Imposter Syndrome in Health Optimization","description":"Despite their technical expertise, they feel like frauds when trying to decode health research and optimize their biology. This creates deep anxiety about making 'wrong' health decisions and exposes vulnerability in an area outside their core competence.","deep_triggers":["Identity threat when analytical skills don't translate to health mastery", "Fear of appearing foolish in health discussions with peers", "Perfectionist need to understand every molecular mechanism", "Comparison to health influencers who seem more knowledgeable", "Anxiety about misinterpreting scientific studies"],"examples":["'I can debug complex code but I can't figure out why my gut is a mess'", "'I feel stupid reading conflicting studies about gut health - maybe I'm missing something obvious'", "'My colleagues think I have everything figured out, but I'm just guessing with supplements'"],"approved_at":"2025-12-01T13:15:08.295705+00:00"}, 
 {"id":"13a30ae3-6045-47f9-8e0e-308bef7fa521","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"faf5c581-0a78-4291-a5d6-68df043f2146","pain_index":2,"name":"Data-Driven Decision Paralysis","description":"Their systematic approach backfires when applied to health decisions, creating endless research loops without clear conclusions. The abundance of conflicting information and lack of personal baseline data creates anxiety about making any decision at all.","deep_triggers":["Need for certainty in uncertain biological systems", "Fear of making suboptimal choices with incomplete data", "Perfectionist paralysis when data points contradict", "Anxiety about opportunity cost of wrong decisions", "Frustration with subjective vs. objective health measures"],"examples":["'I've been researching probiotics for 3 months and I'm more confused than when I started'", "'Every study seems to contradict the last one - how am I supposed to decide?'", "'I need baseline microbiome data but the tests are expensive and unreliable'"],"approved_at":"2025-12-01T13:15:08.295705+00:00"}, 
 {"id":"d506f454-1fbc-4eea-ac31-d4a67a388d12","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"faf5c581-0a78-4291-a5d6-68df043f2146","pain_index":3,"name":"Premium Investment Betrayal Trauma","description":"Repeated failures with expensive, well-researched supplements has created deep cynicism and trust issues. Each new investment triggers fear of being 'fooled again' while simultaneously hoping for breakthrough results.","deep_triggers":["Financial regret from previous supplement failures", "Trust erosion with health marketing claims", "Fear of admitting poor judgment to peers", "Sunk cost fallacy driving continued searching", "Identity crisis around being 'smart consumer'"],"examples":["'I've wasted thousands on AG1, Seed, and other premium brands - nothing works'", "'I feel like an idiot for believing the research behind expensive supplements'", "'My medicine cabinet is a graveyard of failed optimization experiments'"],"approved_at":"2025-12-01T13:15:08.295705+00:00"}, 
 {"id":"fbb73082-7db0-465c-9c8d-806d11f9f9df","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"faf5c581-0a78-4291-a5d6-68df043f2146","pain_index":4,"name":"Performance Decline Terror","description":"Deep existential fear that declining energy, focus, and health are early signs of professional obsolescence in a youth-obsessed tech industry. Their career identity depends on peak cognitive performance.","deep_triggers":["Ageism anxiety in tech industry", "Identity tied to being 'high performer'", "Fear of cognitive decline affecting career trajectory", "Comparison to younger, more energetic colleagues", "Terror of becoming professionally irrelevant"],"examples":["'I can't keep up with 25-year-old developers if my brain is foggy'", "'My afternoon crashes are getting worse - what if I miss a critical deadline?'", "'I used to be the sharpest person in the room, now I feel like I'm fading'"],"approved_at":"2025-12-01T13:15:08.295705+00:00"}, 
 {"id":"fb001834-11c0-4882-9a48-be8556e37ebf","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"faf5c581-0a78-4291-a5d6-68df043f2146","pain_index":5,"name":"Optimization Plateau Desperation","description":"After years of systematic health tracking and optimization, they're hitting diminishing returns while their metrics stagnate or decline. This challenges their core belief that everything can be optimized through data and methodology.","deep_triggers":["Identity crisis when systematic approach fails", "Frustration with biological complexity vs. technical systems", "Fear that they've maximized their potential", "Anxiety about aging despite optimization efforts", "Desperate need for breakthrough innovation"],"examples":["'My HRV and sleep scores have plateaued despite trying everything'", "'I track 20 biomarkers but nothing is improving anymore'", "'Maybe I'm hitting my genetic ceiling and optimization can't help'"],"approved_at":"2025-12-01T13:15:08.295705+00:00"}, 
 {"id":"5937568a-c02d-4162-b080-dddeb520d141","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"faf5c581-0a78-4291-a5d6-68df043f2146","pain_index":6,"name":"Social Isolation in Optimization Journey","description":"Their sophisticated health approach creates distance from both mainstream health conversations and even health-conscious peers. They feel alone in their analytical approach and struggle to find community validation.","deep_triggers":["Loneliness from being 'too advanced' for normal health discussions", "Lack of peer network for validation and troubleshooting", "Social awkwardness around health obsession", "Imposter syndrome in biohacker communities", "Need for intellectual validation of their approach"],"examples":["'My friends think I'm obsessive, but I just want to optimize my health systematically'", "'I can't find anyone else who approaches health with the same rigor I do'", "'Even in biohacker groups, I feel like I'm overcomplicating things'"],"approved_at":"2025-12-01T13:15:08.295705+00:00"}, 
 {"id":"3b81c03f-e1fb-43db-87dc-c5dc58f6b600","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"faf5c581-0a78-4291-a5d6-68df043f2146","pain_index":7,"name":"Time Efficiency Guilt Complex","description":"Constant internal conflict between wanting comprehensive health optimization and needing time-efficient solutions. They feel guilty about shortcuts but anxious about time investment, creating decision paralysis.","deep_triggers":["Perfectionist guilt about taking health shortcuts", "Time scarcity anxiety from demanding work schedules", "Fear that efficient solutions aren't thorough enough", "Identity conflict between optimization and efficiency", "Worry about compromising health for convenience"],"examples":["'I know I should meal prep and take 15 supplements, but I barely have time for breakfast'", "'Am I being lazy by wanting a simple solution, or smart about time management?'", "'Every morning I stress about whether I'm doing enough for my health'"],"approved_at":"2025-12-01T13:15:08.295705+00:00"}, 
 {"id":"d3d441be-03be-4356-beec-3573b15fec7d","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"faf5c581-0a78-4291-a5d6-68df043f2146","pain_index":8,"name":"Early Adopter Status Anxiety","description":"Compulsive need to discover breakthrough health technologies before peers, driven by fear of missing innovation and losing their identity as someone 'ahead of the curve.' Creates pressure to constantly seek new solutions.","deep_triggers":["Identity validation through early adoption", "FOMO on breakthrough health technologies", "Need to maintain innovation leadership status", "Fear of becoming mainstream/basic in health approach", "Competitive anxiety about health knowledge gaps"],"examples":["'I need to find the next big thing in health tech before it goes mainstream'", "'If I'm not discovering new optimization strategies, I'm falling behind'", "'I pride myself on knowing about health innovations that others haven't heard of yet'"],"approved_at":"2025-12-01T13:15:08.295705+00:00"}, 
 {"id":"22b44889-07d0-434b-a6c0-6e1089d54221","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"faf5c581-0a78-4291-a5d6-68df043f2146","pain_index":9,"name":"Professional Image Protection Desperation","description":"Intense fear that visible health issues will damage their reputation as someone who 'has it all figured out.' They desperately hide digestive problems, fatigue, and other symptoms that contradict their optimized professional persona.","deep_triggers":["Professional reputation anxiety tied to health image", "Fear of appearing weak or uncontrolled to colleagues", "Imposter syndrome about being 'wellness expert' among peers", "Social desirability pressure in achievement-oriented culture", "Terror of professional consequences from health vulnerabilities"],"examples":["'I can't let my team see me crash in afternoon meetings'", "'People come to me for health advice - they can't know I'm struggling with gut issues'", "'My professional brand depends on being the optimized, high-energy person'"],"approved_at":"2025-12-01T13:15:08.295705+00:00"}, 
 {"id":"68cd6f8e-9c61-469b-8df5-315cdacfca1b","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"260ec846-ba0f-43d5-82d9-4b2f93a4a440","pain_index":1,"name":"Professional Credibility Schism","description":"Tormenting internal conflict between their medical training that demands evidence-based practice and their desperate personal need for solutions outside conventional medicine. They fear being seen as hypocritical by colleagues for pursuing 'alternative' approaches while simultaneously feeling trapped by the limitations of conventional treatments for their own gut issues.","deep_triggers":["Identity threat between medical professional and supplement user", "Fear of colleague judgment and professional reputation damage", "Cognitive dissonance between skeptical training and personal desperation", "Imposter syndrome when recommending conventional treatments they know don't work for them"],"examples":["'I can't let my colleagues see me taking supplements when I prescribe medications all day'", "'I feel like a fraud telling patients to follow medical protocols when I'm secretly trying functional nutrition'", "'What if someone asks me about this product and I have to admit I use it without clinical trials?'"],"approved_at":"2025-12-01T13:15:27.362897+00:00"}, 
 {"id":"dfbb86d9-bb4c-461f-8bc5-728ab951afb3","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"260ec846-ba0f-43d5-82d9-4b2f93a4a440","pain_index":2,"name":"Healer's Paradox Shame","description":"Deep shame and inadequacy from being unable to heal their own digestive issues despite extensive medical knowledge and spending their career helping others achieve health. This creates profound professional identity crisis and feelings of incompetence that undermine their confidence in patient care.","deep_triggers":["Professional identity as healer contradicted by personal health failures", "Shame spiral about not being able to apply medical knowledge to self", "Fear that health issues compromise patient care quality", "Feeling like a medical failure despite helping others daily"],"examples":["'How can I help patients when I can't even fix my own gut problems?'", "'I'm supposed to be the expert but I feel sicker than my patients'", "'I had to excuse myself during rounds because of severe bloating - I felt so unprofessional'"],"approved_at":"2025-12-01T13:15:27.362897+00:00"}, 
 {"id":"07a1cd60-0bf4-4a66-8fec-93d5df7b5830","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"260ec846-ba0f-43d5-82d9-4b2f93a4a440","pain_index":3,"name":"Premium Investment Validation Anxiety","description":"Intense psychological pressure to justify spending significant money on health solutions by ensuring they reflect genuine scientific superiority, not just marketing. Their medical knowledge of actual production costs and pharmaceutical pricing creates skepticism about premium supplements while their desperation drives willingness to pay.","deep_triggers":["Loss aversion from previous expensive supplement failures", "Professional knowledge of manufacturing costs creating price skepticism", "Need to validate high spending through measurable superior outcomes", "Fear of being financially manipulated by health marketing"],"examples":["'I'm spending more on supplements than some people spend on groceries - this better be revolutionary'", "'I know this probably costs $5 to make but I'm paying $200 - I need proof it's worth it'", "'My medical training tells me this pricing is inflated but I'm desperate enough to try anyway'"],"approved_at":"2025-12-01T13:15:27.362897+00:00"}, 
 {"id":"5cace6f0-c4fd-469e-97d7-5f1bf75d79dc","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"260ec846-ba0f-43d5-82d9-4b2f93a4a440","pain_index":4,"name":"Time Poverty Perfectionism Trap","description":"Devastating frustration from wanting to research every health decision with medical-grade thoroughness but lacking time due to demanding work schedules. This creates a perfectionist paralysis where they feel guilty about quick decisions but don't have bandwidth for proper research, leading to decision avoidance or regret.","deep_triggers":["Perfectionist medical training conflicting with time constraints", "Guilt about making health decisions without thorough research", "Fear of missing critical contraindications or interactions due to rushed decisions", "Overwhelm from having expertise but no time to apply it properly"],"examples":["'I should be reading every study on this ingredient but I barely have time to sleep'", "'I feel irresponsible buying this without researching, but when will I have 10 hours to review papers?'", "'I'm making health decisions like a regular consumer instead of a medical professional and it terrifies me'"],"approved_at":"2025-12-01T13:15:27.362897+00:00"}, 
 {"id":"931fbe2c-6c88-4946-b84f-e4d578f3cabd","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"260ec846-ba0f-43d5-82d9-4b2f93a4a440","pain_index":5,"name":"Shift Work Sabotage Desperation","description":"Hopeless frustration that their demanding healthcare schedule constantly sabotages any consistent health protocol, creating a vicious cycle where work stress worsens gut issues but work demands prevent consistent treatment. They feel trapped in a system that destroys the health they're trying to preserve.","deep_triggers":["Career demands directly conflicting with health needs", "Feeling trapped between professional obligations and personal wellness", "Hopelessness about finding solutions that work with irregular schedules", "Fear that their career is destroying their long-term health"],"examples":["'Every time I start a gut protocol, I get called for overtime and everything falls apart'", "'I'm helping others heal while my job is literally making me sick'", "'How can I maintain any routine when I work days, nights, and weekends randomly?'"],"approved_at":"2025-12-01T13:15:27.362897+00:00"}, 
 {"id":"04029971-1111-47e4-8fe7-fed2cf74bbd3","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"260ec846-ba0f-43d5-82d9-4b2f93a4a440","pain_index":6,"name":"Expert Disappointment Pattern Trauma","description":"Psychological trauma from repeatedly investing in premium, scientifically-marketed health solutions that fail despite their expert evaluation and perfect compliance. Each failure reinforces learned helplessness and makes them simultaneously more desperate and more skeptical, creating decision paralysis.","deep_triggers":["Learned helplessness from repeated supplement failures despite expert selection", "Self-doubt about their ability to evaluate health products despite medical training", "Pattern recognition that even 'scientific' products often fail", "Fear of being fooled again despite professional skepticism"],"examples":["'I've tried every evidence-based gut supplement and nothing works - maybe I'm unfixable'", "'I thought my medical background would help me choose better, but I keep failing'", "'Even the products with clinical studies don't work for me - what's wrong with my body?'"],"approved_at":"2025-12-01T13:15:27.362897+00:00"}, 
 {"id":"cd1681a8-4dda-4b93-884e-8229a24bda59","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"260ec846-ba0f-43d5-82d9-4b2f93a4a440","pain_index":7,"name":"Medication Interaction Paranoia","description":"Paralyzing anxiety about supplement-drug interactions that could harm themselves or patients they advise, made worse by supplement companies' inadequate safety data. Their professional knowledge of drug interactions creates hypervigilance that often prevents them from trying potentially helpful solutions.","deep_triggers":["Professional liability fears about recommending products with unknown interactions", "Personal safety anxiety about interactions with their own medications", "Frustration with supplement industry's inadequate safety documentation", "Responsibility guilt for patients who might ask about products they use"],"examples":["'What if this interacts with the blood pressure medication I prescribe to half my patients?'", "'I can't find interaction data anywhere - how am I supposed to make a safe decision?'", "'A patient asked about this supplement and I panicked because I use it but don't know if it's safe with their meds'"],"approved_at":"2025-12-01T13:15:27.362897+00:00"}, 
 {"id":"94d1299c-963b-4986-b929-26375562faf0","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"260ec846-ba0f-43d5-82d9-4b2f93a4a440","pain_index":8,"name":"Cognitive Performance Deterioration Terror","description":"Escalating fear that gut issues and fatigue are compromising their mental sharpness and decision-making ability, potentially endangering patient safety. This creates intense pressure to find solutions quickly while fearing that cognitive decline might already be affecting their professional competence.","deep_triggers":["Life-and-death responsibility for patient safety despite personal health issues", "Fear that brain fog is compromising clinical judgment", "Career sustainability anxiety about cognitive performance decline", "Moral obligation guilt about providing suboptimal care due to personal health"],"examples":["'I blanked on a medication name during rounds - what if my gut issues are affecting my brain?'", "'I'm making life-or-death decisions while feeling mentally foggy and it scares me'", "'What if a patient suffers because I missed something due to fatigue and digestive issues?'"],"approved_at":"2025-12-01T13:15:27.362897+00:00"}, 
 {"id":"ee2d516b-724c-488d-a872-fc9f36fa48cb","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"b2cbef7c-c10d-4039-a5ec-49b6d3d69b74","pain_index":1,"name":"Medical System Abandonment Trauma","description":"Profound sense of betrayal and abandonment after being failed by the medical establishment they once trusted. They feel dismissed, gaslit, and told to 'learn to live with it' when they desperately need healing solutions. This creates deep mistrust of new interventions while simultaneously driving desperate search for alternatives.","deep_triggers":["Years of being told symptoms are 'in their head' or normal aging", "Doctors offering only symptom management instead of root cause solutions", "Feeling reduced to a diagnosis rather than seen as a whole person", "Medical trauma from procedures, medications, or dismissive treatment", "Loss of faith in authority figures who were supposed to help heal"],"examples":["'My gastroenterologist literally said there's nothing more we can do, just take this antacid for life'", "'I've been to twelve specialists and they all just want to prescribe something to mask the symptoms'", "'I used to trust doctors completely, now I research everything because they've failed me so many times'"],"approved_at":"2025-12-01T13:15:46.785116+00:00"}, 
 {"id":"871849ae-4d34-4c9a-89d0-e31bb502d4f6","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"b2cbef7c-c10d-4039-a5ec-49b6d3d69b74","pain_index":2,"name":"Identity Erosion from Chronic Limitation","description":"Devastating loss of their former capable, energetic self as chronic symptoms restrict their ability to work, socialize, and live fully. They grieve the person they used to be while feeling trapped in a body that betrays them daily, creating profound identity confusion and mourning for their lost life.","deep_triggers":["Inability to maintain career performance or advancement due to symptoms", "Missing important life events due to unpredictable flares", "Comparing current limitations to past capabilities and achievements", "Feeling like a burden to family and friends who don't understand", "Loss of independence and spontaneity in daily life decisions"],"examples":["'I used to be the person everyone could count on, now I have to cancel plans constantly'", "'I look at photos from five years ago and barely recognize that vibrant, confident person'", "'My kids have never known me as healthy - I feel like I'm failing them as a parent'"],"approved_at":"2025-12-01T13:15:46.785116+00:00"}, 
 {"id":"26e31b48-167c-4ac8-8fd4-e5c0011496ed","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"b2cbef7c-c10d-4039-a5ec-49b6d3d69b74","pain_index":3,"name":"Hypervigilant Trigger Paralysis","description":"Constant state of anxious hypervigilance about every food, supplement, or treatment potentially causing a symptom flare. This creates exhausting decision paralysis where they want to try healing interventions but are terrified of making their condition worse, leading to analysis paralysis and self-limiting behaviors.","deep_triggers":["Traumatic memories of severe symptom flares triggered by 'safe' products", "Fear that one wrong choice could cause weeks or months of suffering", "Learned helplessness from unpredictable symptom patterns", "Catastrophic thinking about worst-case scenarios from new interventions", "Loss of trust in their own body's signals and reactions"],"examples":["'I spent three hours researching a single ingredient because I'm terrified it might trigger a flare'", "'I have a cart full of supplements I want to try but I'm too scared to order them'", "'Last time I tried something new, I ended up in the ER - now I question everything'"],"approved_at":"2025-12-01T13:15:46.785116+00:00"}, 
 {"id":"36c99fb6-1d2a-491f-a818-6a2f1b1a23f2","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"b2cbef7c-c10d-4039-a5ec-49b6d3d69b74","pain_index":4,"name":"Invisible Suffering Isolation","description":"Profound loneliness from having a condition that's invisible to others, leading to constant need to justify their limitations while appearing 'normal' on the outside. They feel misunderstood, judged, and isolated from healthy people who can't comprehend their daily struggles, creating deep social disconnection.","deep_triggers":["Having to constantly explain and justify their limitations to others", "Feeling judged as lazy or dramatic when they can't participate fully", "Lack of understanding from family and friends about invisible symptoms", "Social media comparisons with seemingly healthy, active peers", "Feeling excluded from normal social activities due to dietary restrictions"],"examples":["'People see me looking fine and don't understand why I can't just eat pizza at the office party'", "'My family thinks I'm being dramatic about my food restrictions until they see me during a flare'", "'I feel like I'm living in a different world than everyone else - they just don't get it'"],"approved_at":"2025-12-01T13:15:46.785116+00:00"}, 
 {"id":"c9ce1481-e0fe-464e-a517-5f43237684cf","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"b2cbef7c-c10d-4039-a5ec-49b6d3d69b74","pain_index":5,"name":"Hope-Crushing Supplement Graveyard Shame","description":"Deep shame and self-doubt from accumulating countless failed supplement and treatment attempts, creating a 'graveyard' of expensive products that promised healing but delivered disappointment. They feel foolish for continuing to hope while simultaneously desperate not to give up on the possibility of healing.","deep_triggers":["Cabinets full of expensive supplements that didn't work or caused reactions", "Financial guilt about money spent on failed healing attempts", "Self-blame for being 'gullible' or falling for marketing promises", "Family judgment about continued spending on unproven solutions", "Internal conflict between hope for healing and fear of more disappointment"],"examples":["'I have a whole drawer of supplements that were supposed to be the answer - it's like a monument to my desperation'", "'My husband calculated that I've spent $3000 this year on things that didn't work'", "'I feel so stupid for getting my hopes up again, but I can't stop trying'"],"approved_at":"2025-12-01T13:15:46.785116+00:00"}, 
 {"id":"e34e3856-72f3-4014-9620-fd09c61cbac4","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"b2cbef7c-c10d-4039-a5ec-49b6d3d69b74","pain_index":6,"name":"Time Theft Rage and Urgency","description":"Burning rage and panic about years of life being stolen by their condition, combined with desperate urgency to find a solution before more precious time is lost. They watch peers advance in careers, relationships, and life experiences while they're trapped in symptom management, creating intense time scarcity anxiety.","deep_triggers":["Milestone birthdays highlighting years lost to chronic illness", "Watching healthy peers achieve life goals they've had to postpone", "Fear that they're wasting their prime years feeling sick", "Regret about opportunities missed due to health limitations", "Panic that their condition will progressively worsen without intervention"],"examples":["'I'm 45 and feel like I've been treading water for the last decade while everyone else moved forward'", "'Every year that passes without finding a solution feels like another year stolen from my life'", "'I see my college friends traveling and thriving while I'm just trying to make it through each day'"],"approved_at":"2025-12-01T13:15:46.785116+00:00"}, 
 {"id":"589ea670-0280-43cc-beca-eeaf145aee2d","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"b2cbef7c-c10d-4039-a5ec-49b6d3d69b74","pain_index":7,"name":"Intellectual Validation Starvation","description":"Desperate need for their extensive research, health knowledge, and sophisticated understanding of their condition to be recognized and validated rather than dismissed or oversimplified. They've become experts on their condition but feel constantly patronized by generic advice and surface-level solutions.","deep_triggers":["Being given simplistic advice like 'just eat more fiber' after years of research", "Healthcare providers not acknowledging their expertise about their own condition", "Feeling insulted by basic nutritional advice that ignores their complexity", "Need to prove their intelligence and research capabilities to others", "Frustration with products that don't match their sophisticated understanding"],"examples":["'Don't tell me to just eat yogurt for probiotics - I understand SIBO and microbiome diversity better than most doctors'", "'I've read hundreds of research papers on gut barrier function, so please don't treat me like I'm clueless'", "'I need products created by people who understand the science as deeply as I do'"],"approved_at":"2025-12-01T13:15:46.785116+00:00"}, 
 {"id":"ef250978-79af-4af3-9f5a-fae1234fbe55","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"b2cbef7c-c10d-4039-a5ec-49b6d3d69b74","pain_index":8,"name":"Body Betrayal and Control Loss Terror","description":"Terrifying sense that their own body has become an unpredictable enemy that sabotages their plans and dreams without warning. They live in constant fear of when the next flare will strike, creating learned helplessness and desperate need to regain some control over their rebellious system.","deep_triggers":["Unpredictable symptom flares that derail important plans or events", "Loss of trust in their body's ability to function normally", "Feeling betrayed by a body they once relied upon", "Hypervigilance about every physical sensation potentially signaling a flare", "Desperation to find something that gives them control over their symptoms"],"examples":["'I never know if I'll wake up feeling okay or if my gut will ruin my entire day'", "'My body feels like it's working against me - I can't trust it anymore'", "'I used to take my health for granted, now every meal feels like Russian roulette'"],"approved_at":"2025-12-01T13:15:46.785116+00:00"}, 
 {"id":"1fdd7427-c600-43a3-9bec-6cc1f4b597c8","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"9d33d01f-5215-4051-b58f-76f33fc2e6df","pain_index":1,"name":"Intellectual Identity Crisis from Repeated Failures","description":"Deep psychological wound from being deceived by supplement companies despite their careful research and high intelligence. They pride themselves on being analytical and evidence-based, yet have repeatedly made expensive mistakes that make them question their judgment abilities.","deep_triggers":["Cognitive dissonance between self-perception as smart decision-maker and repeated poor choices", "Imposter syndrome about their health expertise after multiple supplement failures", "Fear of intellectual humiliation from being fooled again despite sophisticated vetting", "Identity threat to their role as the 'health-savvy' person in their social circle"],"examples":["'I have a PhD and spent weeks researching, how did I still pick wrong?'", "'People used to ask me for health advice, now I don't trust my own judgment'", "'I feel like an idiot for falling for their marketing despite reading all the studies'"],"approved_at":"2025-12-01T13:16:05.658524+00:00"}, 
 {"id":"50ef3fe1-4f93-4d08-b0e9-68ee90939b74","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"9d33d01f-5215-4051-b58f-76f33fc2e6df","pain_index":2,"name":"Betrayal Trauma from Trusted Health Authorities","description":"Profound sense of betrayal from discovering that respected health influencers, doctors, and brands they trusted had undisclosed financial relationships or provided misleading information. This creates deep cynicism and makes it extremely difficult to trust any new health recommendations.","deep_triggers":["Loss of faith in previously trusted health authorities and systems", "Paranoia about hidden agendas behind every health recommendation", "Emotional wound from feeling manipulated by people they looked up to", "Difficulty distinguishing between authentic expertise and paid promotion"],"examples":["'I found out my favorite health podcast was basically one big supplement ad'", "'Even functional medicine doctors seem to push their own product lines'", "'I don't know who to trust anymore - everyone seems to have an agenda'"],"approved_at":"2025-12-01T13:16:05.658524+00:00"}, 
 {"id":"5b8598a6-e0ff-4d91-877a-016ef35cb830","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"9d33d01f-5215-4051-b58f-76f33fc2e6df","pain_index":3,"name":"Sunk Cost Desperation and Financial Shame","description":"Overwhelming anxiety about the hundreds or thousands of dollars already spent on ineffective supplements, combined with shame about continuing to search for solutions. They feel trapped between stopping their health optimization journey and risking more financial waste.","deep_triggers":["Loss aversion making past supplement spending feel like personal failure", "Shame about spending family money on products that didn't work", "Pressure to justify previous investments by finding something that finally works", "Fear of partner/family judgment about continued health spending"],"examples":["'I've spent over $2000 this year on supplements that are just sitting there'", "'My spouse thinks I have a supplement addiction because nothing works'", "'I need something to work or I'll have to admit this whole approach was wrong'"],"approved_at":"2025-12-01T13:16:05.658524+00:00"}, 
 {"id":"1e6d93bd-bbe5-44e6-b527-f3cbaf60dcb6","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"9d33d01f-5215-4051-b58f-76f33fc2e6df","pain_index":4,"name":"Analysis Paralysis from Information Overload","description":"Mental exhaustion from endless research cycles that lead to contradictory information and decision paralysis. Their analytical nature becomes a curse as they get lost in research rabbit holes without making progress on their actual health issues.","deep_triggers":["Perfectionism preventing them from making decisions with incomplete information", "Fear that insufficient research will lead to another expensive mistake", "Overwhelm from conflicting studies and expert opinions", "Procrastination masked as thorough research to avoid potential failure"],"examples":["'I have 47 browser tabs open researching gut health and I'm more confused than ever'", "'Every study seems to contradict the last one - I don't know what to believe'", "'I've been researching for three months but haven't tried anything new'"],"approved_at":"2025-12-01T13:16:05.658524+00:00"}, 
 {"id":"edde61e3-d7fb-4465-95d4-7efb0f6aa528","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"9d33d01f-5215-4051-b58f-76f33fc2e6df","pain_index":5,"name":"Health Deterioration Urgency with Time Scarcity Panic","description":"Growing anxiety that their health issues are worsening while they waste time on ineffective supplements. They feel mounting pressure that each failed attempt costs them not just money, but precious time for health recovery, especially as they age.","deep_triggers":["Mortality salience increasing with age and persistent health issues", "Opportunity cost anxiety about time wasted on failed solutions", "Fear that optimal health window is closing while they search for solutions", "Regret about years lost to ineffective treatments"],"examples":["'I'm 45 and my gut issues are getting worse while I keep trying things that don't work'", "'I've wasted two years on supplements when I could have been getting better'", "'Every month I don't find a solution is a month closer to serious health problems'"],"approved_at":"2025-12-01T13:16:05.658524+00:00"}, 
 {"id":"1edfdece-732e-4da0-94bd-be54e1cf59e4","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"9d33d01f-5215-4051-b58f-76f33fc2e6df","pain_index":6,"name":"Placebo Effect Self-Doubt and Reality Distortion","description":"Profound confusion about their ability to accurately assess their own body's responses after multiple supplement failures. They question whether any perceived improvements were real or imagined, creating deep uncertainty about their physical self-awareness.","deep_triggers":["Loss of confidence in their ability to read their own body's signals", "Fear that hope and expectation bias clouded their judgment", "Uncertainty about what constitutes genuine improvement vs. wishful thinking", "Anxiety that they can't trust their own experience and perceptions"],"examples":["'I thought that probiotic was helping but maybe I just wanted it to work'", "'I don't know if I actually feel better or if I'm just convincing myself'", "'How can I tell if something is really working when I've been wrong so many times?'"],"approved_at":"2025-12-01T13:16:05.658524+00:00"}, 
 {"id":"d852055c-4ad0-4868-929f-efd61a2deea7","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"9d33d01f-5215-4051-b58f-76f33fc2e6df","pain_index":7,"name":"Social Isolation from Health Expertise Loss","description":"Painful loss of their social identity as the knowledgeable health person in their community. Their supplement failures have damaged their credibility, leaving them isolated from health conversations they used to lead and creating social anxiety about health discussions.","deep_triggers":["Loss of social status as the trusted health advisor in their circle", "Embarrassment about recommending products that didn't work for them or others", "Social identity crisis from being wrong about health solutions publicly", "Isolation from health communities where they once felt confident participating"],"examples":["'My friends stopped asking me for health advice after my last supplement recommendation failed'", "'I used to be confident in health discussions, now I just stay quiet'", "'I'm embarrassed to be in my biohacking group after so many failed experiments'"],"approved_at":"2025-12-01T13:16:05.658524+00:00"}, 
 {"id":"524a77fc-6d69-4f6a-86e0-63d250873790","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"9d33d01f-5215-4051-b58f-76f33fc2e6df","pain_index":8,"name":"Control Helplessness Despite Methodical Approach","description":"Devastating sense that despite their systematic, research-driven approach, they have no real control over their health outcomes. This learned helplessness conflicts with their identity as someone who takes charge of their wellbeing through informed decisions.","deep_triggers":["Learned helplessness from repeated failures despite careful planning", "Loss of agency and empowerment in their health journey", "Conflict between methodical personality and random-seeming health outcomes", "Fear that their analytical approach itself might be flawed"],"examples":["'It doesn't matter how much research I do, nothing seems to work for me'", "'I feel powerless over my own health despite doing everything right'", "'Maybe my systematic approach is wrong if I keep getting bad results'"],"approved_at":"2025-12-01T13:16:05.658524+00:00"}, 
 {"id":"9f5961c3-1687-45a6-88b5-42c51d15fdb0","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"22dd4de4-07b3-493e-8448-13c1f69921de","pain_index":1,"name":"Parental Protection Failure Terror","description":"The overwhelming fear that their health decisions could inadvertently harm their children or fail to protect them from preventable health issues. This creates paralyzing anxiety around every family health choice, as they carry the weight of potentially life-altering consequences for their most precious responsibility.","deep_triggers":["Intense parental responsibility anxiety and hypervigilance about child safety", "Fear of causing irreversible developmental or health damage through wrong choices", "Genetic guilt about passing on their own health struggles to children", "Terror of being blamed by children in the future for health problems", "Perfectionist parenting identity requiring flawless health protection"],"examples":["'What if this microalgae product affects my 8-year-old's development in ways we don't know yet?'", "'I lie awake wondering if I'm experimenting on my kids with these functional foods'", "'My daughter has my sensitive stomach - I can't mess this up for her'"],"approved_at":"2025-12-01T13:16:23.898139+00:00"}, 
 {"id":"a3b6d2b0-18bb-4fe7-9f8b-549f667c3527","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"22dd4de4-07b3-493e-8448-13c1f69921de","pain_index":2,"name":"Health Expert Imposter Syndrome","description":"Despite extensive research and health knowledge, they constantly doubt their expertise when making decisions for their family's health. The gap between their aspiration to be the family health authority and their internal uncertainty creates persistent self-doubt and validation-seeking behavior.","deep_triggers":["Identity conflict between wanting to be health expert but feeling like fraud", "Comparison anxiety with other health-conscious parents who seem more confident", "Fear of medical professionals undermining their credibility with family", "Overwhelming information complexity creating decision paralysis", "Past health decisions that didn't work out as expected"],"examples":["'Other moms seem so sure about their supplement choices - am I missing something obvious?'", "'When the pediatrician questions my approach, I feel like I don't know anything'", "'My husband trusts me with family health decisions, but what if I'm wrong?'"],"approved_at":"2025-12-01T13:16:23.898139+00:00"}, 
 {"id":"7ef81a43-5364-4b74-91b4-ba7f578fff41","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"22dd4de4-07b3-493e-8448-13c1f69921de","pain_index":3,"name":"Generational Health Legacy Anxiety","description":"The crushing pressure to break negative health patterns and establish positive ones that will impact their children's entire lives and future families. They feel responsible not just for current health but for creating habits and choices that will ripple through generations.","deep_triggers":["Fear of perpetuating family health problems across generations", "Urgency around limited time windows for establishing childhood health foundations", "Guilt about their own parents' health choices and determination to do better", "Anxiety about children's future parenting decisions being influenced by current choices", "Perfectionist desire to create ideal health legacy despite imperfect knowledge"],"examples":["'I don't want my kids to struggle with gut issues like I have my whole life'", "'Am I setting them up with healthy habits they'll pass to their kids, or creating food anxiety?'", "'This might be my only chance to fix what my family has always struggled with'"],"approved_at":"2025-12-01T13:16:23.898139+00:00"}, 
 {"id":"cfbdb11a-adb7-4367-bcae-1c9f1b236ed5","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"22dd4de4-07b3-493e-8448-13c1f69921de","pain_index":4,"name":"Family Budget Guilt Complex","description":"Torn between investing in premium health solutions and feeling guilty about the financial impact on family resources. They want the best for their family's health but struggle with justifying expensive products, especially when multiplied across multiple family members.","deep_triggers":["Resource scarcity anxiety about taking money from other family priorities", "Guilt about spending on 'unproven' health products versus concrete family needs", "Fear of partner judgment about expensive health investments", "Comparison stress with families who seem healthy without expensive interventions", "Self-worth questions about deserving premium health solutions"],"examples":["'$600 a month for the whole family feels excessive, but what if it's exactly what we need?'", "'I could buy my daughter new clothes with this money - am I being selfish?'", "'Other families are fine with basic vitamins - why do we need something so expensive?'"],"approved_at":"2025-12-01T13:16:23.898139+00:00"}, 
 {"id":"5aceba0d-7c15-4dd5-95c5-cf54ee3a411b","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"22dd4de4-07b3-493e-8448-13c1f69921de","pain_index":5,"name":"Routine Implementation Failure Shame","description":"The recurring disappointment and self-judgment when they can't maintain consistent health routines for their family despite best intentions. They feel like failures as health guardians when logistics, time constraints, or family resistance derail their wellness plans.","deep_triggers":["Perfectionist expectations about consistent family health routine execution", "Shame about wasting money on products that sit unused due to poor planning", "Identity crisis about being organized health-conscious parent versus chaotic reality", "Guilt about family members missing health benefits due to their implementation failures", "Comparison anxiety with families who seem to effortlessly maintain healthy routines"],"examples":["'I have expensive probiotics expiring in the fridge because mornings are too crazy'", "'My kids forgot to take their supplements again - I'm failing at the basics'", "'I research everything perfectly but can't execute consistently - what's wrong with me?'"],"approved_at":"2025-12-01T13:16:23.898139+00:00"}, 
 {"id":"0e235851-58d1-4a60-95ad-afb01510c3f3","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"22dd4de4-07b3-493e-8448-13c1f69921de","pain_index":6,"name":"Social Health Parenting Judgment Fear","description":"Constant anxiety about being judged by other parents, family members, or healthcare providers for their health choices, especially when pursuing premium or unconventional solutions. They fear being seen as extreme, neglectful, or falling for marketing hype.","deep_triggers":["Social comparison pressure with other parents' seemingly effortless health approaches", "Fear of medical professionals dismissing or criticizing their supplement choices", "Anxiety about extended family questioning their parenting health decisions", "Imposter syndrome about being 'extra' or obsessive about health", "Defensive positioning about spending premium amounts on family nutrition"],"examples":["'The other soccer moms think I'm crazy for researching ingredients this much'", "'My mother-in-law rolls her eyes when she sees our supplement routine'", "'I hide how much we spend on health products because people wouldn't understand'"],"approved_at":"2025-12-01T13:16:23.898139+00:00"}, 
 {"id":"fc415c51-f7cd-4422-b021-6a3ff4e7cdad","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"22dd4de4-07b3-493e-8448-13c1f69921de","pain_index":7,"name":"Child Acceptance Rejection Trauma","description":"The emotional pain of children rejecting health solutions they've carefully researched and invested in, making them feel like failures and questioning whether they're forcing unwanted interventions. Each 'yuck' or refusal feels like a personal rejection of their care and protection.","deep_triggers":["Identity wound when children reject their carefully chosen health solutions", "Guilt about forcing health choices versus respecting children's autonomy", "Anxiety about health gaps when children won't consume beneficial products", "Self-doubt about ability to make good decisions if children consistently resist", "Fear that health anxiety is transferring to children and creating food issues"],"examples":["'My son gags every time I try to give him anything healthy - am I traumatizing him?'", "'She'll eat junk food but refuses the expensive superfood smoothie I made'", "'Maybe I'm creating food anxiety instead of food health - this feels all wrong'"],"approved_at":"2025-12-01T13:16:23.898139+00:00"}, 
 {"id":"0fb10a88-02db-4e11-8945-d8ac091f0e04","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"22dd4de4-07b3-493e-8448-13c1f69921de","pain_index":8,"name":"Information Overwhelm Decision Paralysis","description":"Drowning in conflicting health information and research while feeling pressure to make perfect decisions for their family's wellbeing. The responsibility of choosing correctly for multiple family members creates analysis paralysis and constant second-guessing of their conclusions.","deep_triggers":["Perfectionist pressure to find the 'one right answer' for family health", "Cognitive overload from conflicting expert opinions and research studies", "Fear of missing crucial information that could change their decision", "Responsibility anxiety about consequences of choosing wrong with limited information", "Time pressure to make decisions while wanting to research everything thoroughly"],"examples":["'Every expert says something different - how do I know who to trust with my kids' health?'", "'I've been researching for months but feel more confused than when I started'", "'What if there's some study I missed that shows this isn't safe for children?'"],"approved_at":"2025-12-01T13:16:23.898139+00:00"}, 
 {"id":"78a8ec41-6ab1-4d01-9354-67b650bc1d71","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"fdfbe62f-ccdf-492e-842e-d07fb82e063c","pain_index":1,"name":"Optimization Plateau Terror","description":"The crushing fear that despite all their scientific research, tracking, and premium investments, they've hit their biological ceiling and can't achieve further performance gains. This threatens their core identity as someone who can systematically improve their body and mind through data-driven interventions.","deep_triggers":["Stagnating biomarkers despite perfect protocol adherence", "Identity crisis when optimization efforts stop yielding results", "Fear that their body is fundamentally limited regardless of intervention", "Anxiety about aging catching up despite biohacking efforts", "Competitive disadvantage fear as peers continue advancing"],"examples":["'I've been tracking my HRV for 18 months and it's completely flatlined despite trying everything'", "'My cognitive scores peaked two years ago and nothing I've tried since moves the needle'", "'I'm starting to think I'm genetically maxed out while others keep breaking through'"],"approved_at":"2025-12-01T13:16:43.715484+00:00"}, 
 {"id":"65dafc4e-7877-49fc-974a-fecdf9c93f3a","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"fdfbe62f-ccdf-492e-842e-d07fb82e063c","pain_index":2,"name":"Scientific Credibility Imposter Syndrome","description":"Deep insecurity about whether their self-directed optimization approach is scientifically rigorous enough compared to medical professionals or PhD researchers. They fear being exposed as pseudo-scientific enthusiasts rather than legitimate health optimizers when engaging with true experts.","deep_triggers":["Intellectual inadequacy when discussing protocols with MDs or PhDs", "Fear of being dismissed as 'biohacker wannabe' by medical establishment", "Anxiety about misinterpreting research or following flawed methodologies", "Self-doubt about supplement choices lacking peer-reviewed validation", "Competence questioning when trusted influencers contradict each other"],"examples":["'When my doctor asks about my stack, I feel like I'm playing scientist without credentials'", "'I worry I'm just following expensive placebo protocols disguised as cutting-edge science'", "'Reading conflicting studies makes me question if I actually understand any of this'"],"approved_at":"2025-12-01T13:16:43.715484+00:00"}, 
 {"id":"63ff23d9-e91d-44dc-8478-dfb3be0a3bb6","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"fdfbe62f-ccdf-492e-842e-d07fb82e063c","pain_index":3,"name":"Innovation FOMO Anxiety","description":"Paralyzing fear that while they're stuck with incremental improvements using current methods, other biohackers in their network are accessing revolutionary breakthrough technologies that will leave them behind. This creates urgent pressure to constantly chase the next innovation rather than committing to proven protocols.","deep_triggers":["Social comparison with peers reporting dramatic breakthrough results", "Fear of missing limited access to cutting-edge interventions", "Anxiety about being late adopter rather than innovation leader", "Competitive disadvantage fear in professional performance", "Identity threat of losing early adopter status in community"],"examples":["'Everyone in my biohacker group is talking about results I'm not seeing'", "'I feel like I'm always one breakthrough behind the real optimizers'", "'What if the solution I need exists but I'm wasting time on outdated approaches?'"],"approved_at":"2025-12-01T13:16:43.715484+00:00"}, 
 {"id":"5a7a467f-4d4f-4d33-ad11-913370b062f5","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"fdfbe62f-ccdf-492e-842e-d07fb82e063c","pain_index":4,"name":"Premium Product Disappointment Fatigue","description":"Emotional exhaustion from repeatedly investing significant money in cutting-edge supplements that promise revolutionary results but deliver minimal measurable impact. Each failure compounds their skepticism while simultaneously increasing desperation to find something that actually works.","deep_triggers":["Cognitive dissonance between high investment and poor results", "Trust erosion with premium health brands and influencer recommendations", "Financial guilt over repeated expensive failures", "Hope-disappointment cycle creating emotional exhaustion", "Sunk cost fallacy driving continued searching despite failures"],"examples":["'I've spent over $3000 this year on supplements with zero biomarker improvement'", "'Every new product feels like throwing money at false hope'", "'I'm tired of getting excited about protocols that end up in my failure pile'"],"approved_at":"2025-12-01T13:16:43.715484+00:00"}, 
 {"id":"df68da34-bc8a-4061-9543-1a20884d64da","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"fdfbe62f-ccdf-492e-842e-d07fb82e063c","pain_index":5,"name":"Biomarker Validation Desperation","description":"Intense need for quantifiable proof that their optimization efforts are working, coupled with devastating disappointment when lab results, microbiome tests, or performance metrics show no improvement. Without measurable validation, they question the entire foundation of their health philosophy.","deep_triggers":["Identity crisis when data doesn't support optimization narrative", "Self-worth tied to measurable biological improvements", "Fear that tracking reveals wasted effort rather than progress", "Anxiety about objective failure despite subjective effort", "Professional credibility concerns when results don't match investment"],"examples":["'My inflammatory markers are identical despite six months of perfect gut protocols'", "'I track everything obsessively but the data shows I'm not actually improving'", "'How can I call myself a biohacker when my numbers prove nothing works?'"],"approved_at":"2025-12-01T13:16:43.715484+00:00"}, 
 {"id":"4fa9f406-c9f4-497c-ae9a-b09ccd9c9f12","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"fdfbe62f-ccdf-492e-842e-d07fb82e063c","pain_index":6,"name":"Protocol Perfectionism Paralysis","description":"Overwhelming anxiety about optimizing every detail of their health stack to achieve perfect synergy, leading to analysis paralysis and fear of making suboptimal choices. They become trapped between needing the perfect solution and terror that perfect doesn't exist.","deep_triggers":["Decision paralysis from overwhelming research and conflicting information", "Perfectionist need to optimize every variable simultaneously", "Fear of compound timing or interaction errors undermining results", "Anxiety about disrupting carefully constructed morning routines", "All-or-nothing thinking preventing experimentation with imperfect solutions"],"examples":["'I've researched gut health for six months but can't decide which approach is optimal'", "'What if adding this disrupts the delicate balance I've already created?'", "'I need to understand every interaction before I can commit to changing my stack'"],"approved_at":"2025-12-01T13:16:43.715484+00:00"}, 
 {"id":"427355b6-6000-48c2-a276-0f3198c94e64","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"fdfbe62f-ccdf-492e-842e-d07fb82e063c","pain_index":7,"name":"Cellular Aging Existential Dread","description":"Deep fear that despite all their optimization efforts, cellular damage and aging are progressing faster than their interventions can repair. This creates urgent pressure to find more powerful solutions before irreversible decline occurs.","deep_triggers":["Mortality salience despite optimization efforts", "Fear that current interventions are insufficient against aging", "Anxiety about time window closing for cellular repair", "Panic about missing critical intervention period", "Existential terror about biological inevitability despite control efforts"],"examples":["'I feel like I'm losing the race against cellular damage despite everything I do'", "'My recovery times are getting longer and I'm terrified optimization isn't enough'", "'What if I've already missed the window for preventing age-related decline?'"],"approved_at":"2025-12-01T13:16:43.715484+00:00"}, 
 {"id":"3c961e3b-7ef5-4c3e-a815-3e48f88c1eba","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"fdfbe62f-ccdf-492e-842e-d07fb82e063c","pain_index":8,"name":"Community Status Competence Anxiety","description":"Fear of losing credibility and respect within their biohacking community when they can't demonstrate the impressive results that others report. This threatens their identity as a successful optimizer and creates pressure to either lie about results or find breakthrough solutions.","deep_triggers":["Social comparison pressure in optimization-focused communities", "Fear of being exposed as unsuccessful despite significant investment", "Imposter syndrome in high-achieving peer groups", "Status anxiety about falling behind network standards", "Identity threat when results don't match community expectations"],"examples":["'Everyone in my forum shares amazing progress photos while I look the same'", "'I avoid biohacker meetups because I have nothing impressive to report'", "'I feel like a fraud when people ask about my latest breakthroughs'"],"approved_at":"2025-12-01T13:16:43.715484+00:00"}, 
 {"id":"c817943c-66ca-4181-bfd2-1c65c7793dbc","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"ba978ac4-68e6-484a-a12a-f72a43ab0f82","pain_index":1,"name":"Intellectual superiority validation anxiety","description":"Despite extensive functional medicine knowledge, they constantly fear their health choices won't reflect their sophisticated understanding or impress their practitioner and peers. They need their product choices to validate their identity as health experts who understand mechanisms others can't grasp.","deep_triggers":["Imposter syndrome about their health expertise despite significant education investment", "Need to justify expensive functional medicine consultations through sophisticated choices", "Fear of being grouped with mainstream supplement consumers", "Anxiety about practitioner judging their independent research capabilities"],"examples":["'I need something my functional medicine doctor will be impressed I found on my own'", "'I can't use the same products as people who just follow Instagram influencers'", "'If I bring this to my next appointment, will my practitioner think I actually understand root-cause healing?'"],"approved_at":"2025-12-01T13:17:04.821693+00:00"}, 
 {"id":"49638847-5368-43f5-bc86-a16e9435c154","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"ba978ac4-68e6-484a-a12a-f72a43ab0f82","pain_index":2,"name":"Cellular degeneration terror","description":"An underlying horror that despite all their knowledge and investments, cellular damage is accumulating faster than their interventions can repair it. They obsess over whether their current approach is truly preventing the mitochondrial dysfunction and oxidative stress they understand leads to aging and disease.","deep_triggers":["Knowledge of how cellular damage compounds over time creates urgency", "Fear that their current energy decline signals irreversible aging", "Terror of becoming dependent on medications they're trying to avoid", "Anxiety that their preventive approach isn't aggressive enough"],"examples":["'What if my cells are dying faster than I can repair them with these basic supplements?'", "'I understand the science - every day I wait, more mitochondrial damage accumulates'", "'I'm terrified I'll end up like my parents despite everything I know about prevention'"],"approved_at":"2025-12-01T13:17:04.821693+00:00"}, 
 {"id":"f69f11de-95b4-4543-a00b-e331c77ffc0d","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"ba978ac4-68e6-484a-a12a-f72a43ab0f82","pain_index":3,"name":"Premium investment justification paralysis","description":"Having been burned by expensive health products that promised practitioner-grade results but delivered mainstream outcomes, they're trapped between knowing they need to invest in quality and terror of making another costly mistake. Each purchase decision becomes an agonizing analysis of whether the premium price reflects genuine therapeutic value.","deep_triggers":["Sunk cost trauma from previous expensive supplement failures", "Guilt about spending family resources on unproven interventions", "Fear of financial regret if the product doesn't deliver measurable results", "Anxiety about appearing fiscally irresponsible to their partner"],"examples":["'I've already spent $3,000 this year on supplements that didn't work - how do I know this won't be another expensive mistake?'", "'My husband keeps asking why I need $200 monthly supplements when my blood work looks the same'", "'I'm scared to calculate how much I've wasted on products that promised everything and delivered nothing'"],"approved_at":"2025-12-01T13:17:04.821693+00:00"}, 
 {"id":"cf58b275-d031-490f-88df-47afd8ae6dff","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"ba978ac4-68e6-484a-a12a-f72a43ab0f82","pain_index":4,"name":"Bioactivity authenticity obsession","description":"Their deep understanding of how processing destroys therapeutic compounds creates an almost compulsive need to verify that nutrients retain their natural potency and structure. They're haunted by the knowledge that most supplements are nutritionally 'dead' compared to their whole-food sources, making them question whether any processed product can truly deliver therapeutic results.","deep_triggers":["Knowledge that heat and processing destroy the very compounds they need", "Perfectionist need to optimize every aspect of their health protocol", "Fear that they're paying premium prices for degraded nutrients", "Anxiety that their sophisticated approach is undermined by inferior processing"],"examples":["'How do I know these nutrients haven't been destroyed by manufacturing like everything else?'", "'I understand the biochemistry - if the processing kills the compounds, I'm just taking expensive placebo'", "'I need proof this isn't just another powder that's lost all its therapeutic value'"],"approved_at":"2025-12-01T13:17:04.821693+00:00"}, 
 {"id":"a46f85b9-bbbb-4a5e-bf54-c549aedfab25","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"ba978ac4-68e6-484a-a12a-f72a43ab0f82","pain_index":5,"name":"Root cause solution desperation","description":"Years of symptom management and temporary fixes have created a desperate urgency to finally address the underlying dysfunction they intellectually understand but can't seem to resolve. They're emotionally exhausted from the cycle of hope and disappointment, knowing the mechanisms but unable to find interventions that actually heal at the cellular level.","deep_triggers":["Learned helplessness from repeated cycles of temporary improvement followed by symptom return", "Frustration that their extensive knowledge hasn't translated to healing", "Fear that their gut dysfunction is too advanced for natural interventions", "Anxiety that they're running out of time to reverse underlying damage"],"examples":["'I understand leaky gut and dysbiosis better than most doctors, so why can't I fix this?'", "'I'm tired of managing symptoms - I need something that actually heals the epithelial barrier'", "'Every intervention works for a few weeks then my digestive issues come back - what am I missing?'"],"approved_at":"2025-12-01T13:17:04.821693+00:00"}, 
 {"id":"ba1d81f2-d6b8-46ba-9bbd-c7ff7cb91e59","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"ba978ac4-68e6-484a-a12a-f72a43ab0f82","pain_index":6,"name":"Cognitive performance decline panic","description":"As high-performing knowledge workers, any decline in mental clarity, memory, or focus triggers existential terror about their professional identity and future success. They understand the gut-brain connection scientifically but feel helpless watching their cognitive edge slip away despite their sophisticated health protocols.","deep_triggers":["Professional identity threat from declining cognitive performance", "Fear of career impact from brain fog and concentration issues", "Terror of premature cognitive aging despite prevention efforts", "Anxiety that colleagues will notice their mental performance decline"],"examples":["'I used to be the sharpest person in the room - now I struggle to focus in important meetings'", "'My brain fog is affecting my work performance and I know my gut health is the root cause'", "'What if my cognitive decline continues and I can't compete in my demanding career?'"],"approved_at":"2025-12-01T13:17:04.821693+00:00"}, 
 {"id":"3a3ddd35-5b93-4662-b5f0-b68cab7ff4dc","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"ba978ac4-68e6-484a-a12a-f72a43ab0f82","pain_index":7,"name":"Practitioner-grade authenticity verification paralysis","description":"Their functional medicine education has shown them the vast quality gap between practitioner-dispensed and consumer supplements, creating paralyzing uncertainty about whether any direct-to-consumer product can meet therapeutic standards. They're trapped between needing practitioner-grade interventions and wanting independence in their health choices.","deep_triggers":["Knowledge of supplement industry quality control failures", "Need for independence from constant practitioner oversight", "Fear of compromising their health protocol with inferior products", "Anxiety about making uninformed choices despite extensive education"],"examples":["'How do I know this meets the same standards as what my functional medicine doctor would recommend?'", "'I want to be proactive between appointments but I'm terrified of choosing something that undermines my protocol'", "'Is this actually pharmaceutical-grade or just marketing to people like me who know to ask?'"],"approved_at":"2025-12-01T13:17:04.821693+00:00"}, 
 {"id":"2aae8bd1-bf7b-4578-9028-0c1352f4234b","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"ba978ac4-68e6-484a-a12a-f72a43ab0f82","pain_index":8,"name":"Health optimization plateau frustration","description":"Despite investing thousands in functional medicine consultations, advanced testing, and premium interventions, they've hit a plateau where additional improvements feel impossible to achieve. This creates deep frustration and self-doubt about whether they're missing some crucial piece of the health optimization puzzle they should understand.","deep_triggers":["Perfectionist need to continuously optimize and improve health metrics", "Fear that they've reached the limits of natural intervention effectiveness", "Anxiety that other health-conscious peers are achieving better results", "Self-doubt about their ability to interpret and apply complex health information"],"examples":["'I've optimized everything I can think of but I still don't feel as vibrant as I should'", "'Other people in my functional medicine community seem to get better results - what am I doing wrong?'", "'I've invested so much in my health but I feel like I've hit a wall in my progress'"],"approved_at":"2025-12-01T13:17:04.821693+00:00"}, 
 {"id":"840e25ba-3f79-43f7-acf2-e88aed533d16","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"a73172c2-227e-42b6-8782-176c65c68499","pain_index":1,"name":"Fear of Athletic Prime Slipping Away","description":"Deep existential anxiety that their peak performance years are being wasted due to suboptimal recovery and gut health issues. They obsess over every training session that feels compromised by poor recovery, viewing it as irreplaceable time stolen from their athletic potential.","deep_triggers":["Awareness that athletic performance window is finite and closing", "Perfectionist need to maximize every controllable performance variable", "Regret about past training years potentially wasted on suboptimal protocols", "Comparison with younger athletes who seem to recover effortlessly", "Fear that current digestive issues are secretly limiting their ceiling"],"examples":["'I'm 38 and I can feel my window closing - I can't afford to waste any more time with mediocre recovery'", "'Every bad training session due to bloating feels like stealing from my future self'", "'I watch 25-year-olds bounce back overnight and wonder if my gut health is holding me back'"],"approved_at":"2025-12-01T13:17:27.218704+00:00"}, 
 {"id":"941270f6-4e35-4878-9dbd-003ae1833837","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"a73172c2-227e-42b6-8782-176c65c68499","pain_index":2,"name":"Impostor Syndrome in Athletic Identity","description":"Crushing self-doubt about whether they truly deserve to call themselves serious athletes when their gut health issues compromise performance. They fear being exposed as less committed or knowledgeable than they project, especially when digestive problems disrupt training in front of others.","deep_triggers":["Social comparison with 'real' athletes who seem to have perfect systems", "Embarrassment about digestive issues affecting training consistency", "Pressure to maintain expert reputation in their athletic community", "Fear of being judged for supplement choices or failures", "Guilt about not being tough enough to push through gut discomfort"],"examples":["'I feel like a fraud when I have to skip intervals because of bloating'", "'Other athletes talk about pushing through pain, but gut issues feel different - am I just weak?'", "'I act like I have all the answers about performance nutrition, but my own system is a mess'"],"approved_at":"2025-12-01T13:17:27.218704+00:00"}, 
 {"id":"d3c9b914-7a80-448a-8f66-1f029bdc2939","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"a73172c2-227e-42b6-8782-176c65c68499","pain_index":3,"name":"Supplement Graveyard Shame Spiral","description":"Overwhelming shame and financial regret about the growing collection of abandoned supplements that promised gut health and performance benefits but delivered nothing. Each new purchase triggers guilt about past failures and fear of repeating the same expensive mistakes.","deep_triggers":["Accumulated financial losses from ineffective premium supplements", "Self-blame for falling for marketing despite being 'smart' about research", "Embarrassment about supplement cabinet full of failed experiments", "Pressure to justify supplement spending to skeptical partners", "Analysis paralysis from over-researching due to past failures"],"examples":["'My supplement graveyard represents thousands of dollars and zero results'", "'I research for weeks now because I can't handle another $200 mistake'", "'My wife sees my supplement collection and thinks I'm addicted to false hope'"],"approved_at":"2025-12-01T13:17:27.218704+00:00"}, 
 {"id":"0f003404-ceb2-4913-8caf-5f6c300b557d","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"a73172c2-227e-42b6-8782-176c65c68499","pain_index":4,"name":"Competitive Paranoia About Secret Advantages","description":"Consuming anxiety that competitors have discovered superior gut health protocols that provide hidden performance advantages while they struggle with the same old digestive issues. This creates obsessive research behavior and fear of missing the 'one thing' that could transform their performance.","deep_triggers":["Hypercompetitive nature that can't accept any disadvantage", "Fear that successful competitors have nutritional secrets they don't", "Obsessive need to optimize every possible performance variable", "Paranoia about falling behind in the 'optimization arms race'", "Envy watching others recover faster or perform more consistently"],"examples":["'I wonder if the athletes who never seem to have gut issues know something I don't'", "'When someone PRs consistently, I obsess over what they're doing differently'", "'I stay up late researching protocols because I'm terrified of missing the breakthrough'"],"approved_at":"2025-12-01T13:17:27.218704+00:00"}, 
 {"id":"4bcf882d-b67d-4b33-8527-7078590e26a2","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"a73172c2-227e-42b6-8782-176c65c68499","pain_index":5,"name":"Training Investment Betrayal","description":"Bitter frustration that their massive investment in training time, coaching, and discipline is being sabotaged by digestive issues they can't control. They feel betrayed by their own body when gut problems prevent them from executing the training they've planned and paid for.","deep_triggers":["Resentment that digestive issues are stealing returns on training investment", "Guilt about wasted coaching sessions due to gut-related performance drops", "Anger at their body for not supporting their dedication and sacrifice", "Fear that gut issues make their training investment pointless", "Frustration with lack of control over digestive system despite controlling everything else"],"examples":["'I sacrifice everything for training, then my gut betrays me during key workouts'", "'It's infuriating to nail my training plan but feel like crap because of digestive issues'", "'I invest in the best coaching and equipment, but my gut health holds everything back'"],"approved_at":"2025-12-01T13:17:27.218704+00:00"}, 
 {"id":"06cf8d8b-7818-4753-a966-78233924c39b","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"a73172c2-227e-42b6-8782-176c65c68499","pain_index":6,"name":"Scientific Credibility Crisis","description":"Deep frustration and intellectual embarrassment about not being able to solve their gut health puzzle despite extensive research and scientific literacy. They pride themselves on evidence-based decisions but feel stupid for not cracking this particular code.","deep_triggers":["Intellectual pride damaged by inability to solve a 'simple' health problem", "Embarrassment about gaps in their supposedly comprehensive health knowledge", "Frustration with conflicting research and lack of athletic-specific studies", "Self-doubt about research and evaluation skills after repeated failures", "Pressure to maintain reputation as the 'health expert' in their circle"],"examples":["'I can analyze VO2 max studies but can't figure out my own digestive system'", "'People ask me for nutrition advice, but I can't even fix my own gut health'", "'I've read hundreds of papers on gut health but still feel clueless about what actually works'"],"approved_at":"2025-12-01T13:17:27.218704+00:00"}, 
 {"id":"4f56ced5-6451-4389-81e4-78bfdfa93c8b","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"a73172c2-227e-42b6-8782-176c65c68499","pain_index":7,"name":"Recovery Metrics Gaslighting","description":"Psychological torment from tracking detailed recovery metrics (HRV, sleep scores, inflammation markers) that show suboptimal results but not being able to pinpoint whether gut health is the culprit. This creates obsessive monitoring behavior and constant second-guessing of their optimization efforts.","deep_triggers":["Perfectionist need for data-driven optimization being thwarted by unclear correlations", "Frustration with inability to isolate gut health impact from other variables", "Obsessive tracking leading to analysis paralysis rather than solutions", "Self-doubt about whether their optimization approach is fundamentally flawed", "Anxiety about making decisions without clear data supporting gut health ROI"],"examples":["'My HRV stays low but I can't prove it's gut-related - am I chasing the wrong thing?'", "'I track everything obsessively but can't connect the dots between gut health and performance'", "'The data shows I'm not recovering optimally, but I don't know if fixing my gut will actually help'"],"approved_at":"2025-12-01T13:17:27.218704+00:00"}, 
 {"id":"232302f1-4852-42d3-9c2c-e6e99c135ef9","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"a73172c2-227e-42b6-8782-176c65c68499","pain_index":8,"name":"Clean Label Compromise Torture","description":"Agonizing internal conflict between their values-driven need for clean, natural supplements and their desperate desire for something that actually works. They torture themselves over every artificial ingredient while feeling like hypocrites for potentially compromising their health principles.","deep_triggers":["Identity conflict between health values and performance desperation", "Fear of long-term health consequences from artificial supplement ingredients", "Guilt about potentially betraying their clean-living athletic identity", "Anxiety about what artificial ingredients might do to their carefully maintained system", "Self-judgment for considering 'impure' solutions due to desperation"],"examples":["'I'm so desperate for results I'm considering supplements with artificial additives - what's wrong with me?'", "'Every effective product seems to have some sketchy ingredient that goes against everything I believe'", "'I preach clean eating but I'm tempted by synthetic solutions because nothing natural works'"],"approved_at":"2025-12-01T13:17:27.218704+00:00"}, 
 {"id":"159d3f36-7e27-4bc5-ad40-9a77d4b76160","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"f81beda1-abd9-4969-993c-05a62b4ff695","pain_index":1,"name":"Time-running-out desperation","description":"Paralyzing fear that critical intervention windows for healthy aging are closing while they're still researching and deliberating. Every day of delay feels like irreversible loss of vitality preservation opportunity. The urgency to act wars with their methodical research nature, creating constant anxiety about missed chances.","deep_triggers":["Mortality salience increasing with age milestones and peer health decline", "Scientific understanding that aging interventions are most effective when started early", "Perfectionist paralysis preventing timely action despite urgency awareness", "Regret about past delays in health optimization creating pressure to act now", "Fear that their careful research approach is actually sabotaging their health outcomes"],"examples":["'I've been researching gut health for six months while my digestion keeps getting worse - what if I've already waited too long?'", "'Every birthday feels like another year I didn't optimize my health properly'", "'I watch my friends aging rapidly and wonder if I'm researching myself into the same decline'"],"approved_at":"2025-12-01T13:17:49.094091+00:00"}, 
 {"id":"4be93d1b-83dc-4299-a839-66ec6ce61f61","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"f81beda1-abd9-4969-993c-05a62b4ff695","pain_index":2,"name":"Cognitive decline prevention panic","description":"Visceral terror about losing mental sharpness and becoming cognitively diminished, especially after experiencing minor memory lapses or brain fog. The gut-brain connection research creates both hope and pressure to find the right intervention before irreversible decline sets in. Every forgotten name or lost word triggers existential fear about their mental future.","deep_triggers":["Identity threat from being seen as mentally declining or incompetent", "Loss of control over their most valued asset - their sharp mind", "Fear of becoming a burden or losing independence due to cognitive issues", "Anxiety about not recognizing family members or losing personality", "Pressure to preserve professional reputation and intellectual legacy"],"examples":["'I used to have a photographic memory - now I can't remember where I put my keys and I'm terrified this is just the beginning'", "'What if I'm watching my brain deteriorate and doing nothing to stop it?'", "'My grandmother had dementia and I see myself in every forgotten word'"],"approved_at":"2025-12-01T13:17:49.094091+00:00"}, 
 {"id":"b21b6c6c-94dc-457f-81a7-2cb79c8926f0","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"f81beda1-abd9-4969-993c-05a62b4ff695","pain_index":3,"name":"Sophisticated buyer imposter syndrome","description":"Deep insecurity about whether they're actually as knowledgeable about health optimization as they believe, despite extensive research. Fear of being fooled by marketing disguised as science, or missing obvious red flags that truly sophisticated buyers would catch. Their expertise identity feels constantly under threat when facing complex decisions.","deep_triggers":["Comparison with younger biohackers who seem more cutting-edge", "Past supplement failures undermining confidence in their judgment", "Overwhelming amount of conflicting health information creating self-doubt", "Fear of being seen as naive despite their educated background", "Imposter syndrome about their health optimization knowledge vs actual experts"],"examples":["'I have three degrees but I still feel lost trying to evaluate these health claims'", "'Maybe I'm not as smart about supplements as I thought if I keep choosing wrong'", "'These young influencers seem to know things I don't despite my decades of experience'"],"approved_at":"2025-12-01T13:17:49.094091+00:00"}, 
 {"id":"015298cd-0521-429f-ad41-89b6b7bb306d","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"f81beda1-abd9-4969-993c-05a62b4ff695","pain_index":4,"name":"Body betrayal and control loss grief","description":"Profound grief and rage about their body no longer responding predictably to health interventions that worked in the past. Feeling betrayed by digestive issues, energy crashes, and declining resilience despite 'doing everything right.' The loss of bodily control threatens their identity as someone who can manage their health through discipline and good choices.","deep_triggers":["Grieving the loss of their younger, more responsive body", "Anger at feeling powerless against natural aging processes", "Identity crisis when health discipline doesn't guarantee results", "Fear that their body is becoming unpredictable and uncontrollable", "Shame about needing more help to maintain what used to be effortless"],"examples":["'I eat better and exercise more than people half my age but I feel worse - it's not fair'", "'My body used to bounce back from anything, now everything hurts and nothing works'", "'I feel like I'm fighting a losing battle against my own biology'"],"approved_at":"2025-12-01T13:17:49.094091+00:00"}, 
 {"id":"5c443fab-b51f-40e0-bb8f-1fbd145d46e5","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"f81beda1-abd9-4969-993c-05a62b4ff695","pain_index":5,"name":"Burden-to-family terror","description":"Haunting fear of becoming a health burden to their children or spouse, especially after witnessing their own parents' decline. Every digestive issue or energy crash triggers anxiety about dependency and loss of dignity. The pressure to model successful aging while secretly struggling creates isolation and shame about their health challenges.","deep_triggers":["Witnessing their own parents' health decline and family stress", "Guilt about potentially limiting their children's life choices", "Loss of dignity associated with needing help or care", "Fear of being seen as weak or failing at healthy aging", "Anxiety about medical expenses impacting family inheritance"],"examples":["'I don't want my kids to go through what I went through with my mother'", "'Every time I feel sick I wonder if this is the beginning of the end of my independence'", "'I need to figure out my health now before I become someone else's problem'"],"approved_at":"2025-12-01T13:17:49.094091+00:00"}, 
 {"id":"a7314d2a-2bb6-4a5a-b176-b49ad236ef12","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"f81beda1-abd9-4969-993c-05a62b4ff695","pain_index":6,"name":"Peer comparison aging shame","description":"Crushing shame when comparing their energy, appearance, or health status to peers who seem to be aging more gracefully. Social gatherings become minefields of subtle health comparisons and vitality competitions. Fear of being seen as the one who 'let themselves go' despite significant health investments creates social anxiety and isolation.","deep_triggers":["Social comparison bias intensified by age-related insecurities", "Status anxiety about appearing less vital than their peer group", "Shame about visible signs of aging or health struggles", "Fear of losing social position due to health decline", "Competitive nature applied to aging outcomes and health optimization"],"examples":["'At our reunion, everyone commented on how great Susan looks while I felt invisible and tired'", "'I avoid social gatherings because I can't keep up the energy that others seem to have naturally'", "'My tennis partner is five years older but has twice my stamina - I'm embarrassed'"],"approved_at":"2025-12-01T13:17:49.094091+00:00"}, 
 {"id":"82915743-5578-4794-a26b-99392e1f207d","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"f81beda1-abd9-4969-993c-05a62b4ff695","pain_index":7,"name":"Legacy and generativity failure anxiety","description":"Deep anxiety about failing to leave a legacy of wisdom about healthy aging for their family and community. Fear that their health struggles undermine their ability to be the wise elder they aspired to become. The gap between their envisioned role as a health-conscious role model and their current struggles creates profound identity crisis.","deep_triggers":["Generativity drive to guide younger generations being threatened by health struggles", "Identity as the 'healthy one' in the family being challenged by aging reality", "Fear of hypocrisy when giving health advice while struggling privately", "Anxiety about not fulfilling their elder wisdom potential", "Guilt about not being the role model their family needs"],"examples":["'How can I advise my kids about healthy living when I can't even fix my own digestive issues?'", "'I wanted to be the vibrant grandmother who travels and teaches - not the one with constant health problems'", "'My health struggles make me feel like a failure at the one thing I thought I had mastered'"],"approved_at":"2025-12-01T13:17:49.094091+00:00"}, 
 {"id":"c12c2bc3-1509-4927-aa33-1795ae30525b","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"f81beda1-abd9-4969-993c-05a62b4ff695","pain_index":8,"name":"Professional medical dismissal isolation","description":"Profound loneliness and frustration from being dismissed by traditional healthcare providers when seeking proactive health optimization rather than disease treatment. Feeling caught between doctors who don't understand functional nutrition and wellness practitioners who seem sales-focused. This medical limbo creates isolation in their health journey and doubt about their approach.","deep_triggers":["Authority validation seeking being frustrated by medical dismissal", "Isolation from lack of professional support for their health philosophy", "Doubt about their proactive approach when experts seem skeptical", "Fear of making decisions without proper medical guidance", "Frustration with healthcare system that waits for problems rather than preventing them"],"examples":["'My doctor says my tests are fine but I feel terrible - no one takes my concerns seriously'", "'I feel like I'm navigating this alone because real doctors don't believe in prevention'", "'I'm spending thousands on functional medicine because traditional medicine failed me, but I'm not sure who to trust'"],"approved_at":"2025-12-01T13:17:49.094091+00:00"}, 
 {"id":"b5f71c77-2316-4857-aed8-76bfb217f5e6","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"b0367578-4c47-4149-87f5-492db909fcf8","pain_index":1,"name":"Intelligent Person's Supplement Shame","description":"Deep embarrassment about repeatedly falling for health product marketing despite their education and research skills. They feel their intelligence should protect them from making 'dumb' purchases, yet they keep accumulating ineffective supplements. This creates a painful disconnect between their self-image as savvy, informed consumers and their track record of supplement failures.","deep_triggers":["Cognitive dissonance between self-perceived intelligence and purchase outcomes", "Imposter syndrome about health knowledge and decision-making abilities", "Fear that others will discover their 'foolish' health spending patterns", "Perfectionist need to make flawless, research-backed decisions", "Identity threat to their reputation as the 'health-conscious' person in their social circle"],"examples":["'I have a master's degree but I keep buying supplements that don't work - what's wrong with me?'", "'I research everything for weeks but still end up with expensive placebo pills'", "'My friends ask me for health advice but I secretly feel like a fraud with my cabinet full of failed experiments'"],"approved_at":"2025-12-01T13:18:08.278685+00:00"}, 
 {"id":"48e183e4-325c-40e1-a9f7-32e3f73172d3","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"b0367578-4c47-4149-87f5-492db909fcf8","pain_index":2,"name":"Invisible Decline Panic","description":"Haunting fear that their digestive issues, brain fog, and energy crashes are early warning signs of serious health decline that others can't see yet but will eventually become obvious. They worry they're on a trajectory toward chronic illness, autoimmune disease, or premature aging while appearing healthy on the surface. This creates urgent anxiety about preventing invisible damage before it becomes irreversible.","deep_triggers":["Catastrophic thinking about minor health symptoms escalating", "Fear of losing control over their health trajectory and future quality of life", "Anxiety about genetic predispositions manifesting through poor gut health", "Terror of becoming a cautionary tale among health-conscious peers", "Temporal anxiety about limited time window for effective prevention"],"examples":["'What if this bloating is actually the start of something serious that doctors aren't catching?'", "'I look fine now but I can feel my body breaking down from the inside'", "'My grandmother's autoimmune issues started with digestive problems just like mine'"],"approved_at":"2025-12-01T13:18:08.278685+00:00"}, 
 {"id":"f54b367d-1ac6-4814-b4d5-a25c30e7bb5b","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"b0367578-4c47-4149-87f5-492db909fcf8","pain_index":3,"name":"Professional Performance Vulnerability","description":"Deep anxiety that their digestive unpredictability, brain fog episodes, and energy crashes will be noticed by colleagues and damage their career trajectory during crucial advancement years. They fear being seen as unreliable, unfocused, or lacking the stamina for leadership roles. This is especially painful because they've invested heavily in their career and see health issues as a threat to their professional identity and success.","deep_triggers":["Fear of career sabotage by unpredictable health symptoms", "Anxiety about colleagues perceiving them as weak or unreliable", "Perfectionist need to maintain flawless professional image", "Identity fusion between health optimization and career success", "Impostor syndrome about deserving promotions while struggling with health"],"examples":["'I had to excuse myself from an important client meeting because of sudden digestive distress - so embarrassing'", "'I worry my brain fog during presentations makes me look incompetent to my manager'", "'How can I ask for more responsibility when I can barely manage my energy levels consistently?'"],"approved_at":"2025-12-01T13:18:08.278685+00:00"}, 
 {"id":"be67eb82-14e7-4d95-9df1-ccc6ca2690a3","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"b0367578-4c47-4149-87f5-492db909fcf8","pain_index":4,"name":"Research Validation Desperation","description":"Painful need to justify the countless hours spent researching health solutions that have led to disappointing results. They feel their extensive research efforts should guarantee success, but instead they're trapped in analysis paralysis and information overload. This creates a desperate hunger to finally find a product that validates their research investment and proves they haven't been wasting their intellectual efforts.","deep_triggers":["Sunk cost fallacy around time invested in health research", "Need to validate their information-gathering and decision-making abilities", "Intellectual narcissism requiring sophisticated solutions others don't understand", "Fear that their research methodology is fundamentally flawed", "Perfectionist belief that enough research should guarantee perfect outcomes"],"examples":["'I've read hundreds of PubMed studies but still can't figure out what will actually work for me'", "'All this research feels pointless if I keep making the wrong choices anyway'", "'I need to find something that proves I'm actually good at this health optimization thing'"],"approved_at":"2025-12-01T13:18:08.278685+00:00"}, 
 {"id":"9d56e67e-77ba-4a1c-a869-5954a783aff3","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"b0367578-4c47-4149-87f5-492db909fcf8","pain_index":5,"name":"Sustainable Values Betrayal","description":"Moral anguish about betraying their environmental and ethical values by purchasing synthetic supplements in plastic bottles while preaching natural, sustainable living. They feel hypocritical about their health choices conflicting with their values, creating internal tension between their wellness needs and ethical identity. This pain intensifies when they realize their supplement graveyard represents both wasted money and environmental waste.","deep_triggers":["Cognitive dissonance between environmental values and supplement purchasing", "Guilt about generating plastic waste through failed health experiments", "Identity conflict between authentic natural living and synthetic solutions", "Social anxiety about being exposed as hypocritical by environmentally conscious peers", "Moral perfectionism requiring complete alignment between values and actions"],"examples":["'I preach about avoiding processed foods but my cabinet is full of synthetic vitamins in plastic bottles'", "'How can I lecture friends about sustainability while generating all this supplement waste?'", "'I feel like a fraud promoting natural wellness while relying on artificial solutions'"],"approved_at":"2025-12-01T13:18:08.278685+00:00"}, 
 {"id":"d857fc15-a1f6-43ae-b737-c2556474e139","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"b0367578-4c47-4149-87f5-492db909fcf8","pain_index":6,"name":"Control Recovery Desperation","description":"Devastating sense of losing control over their body after experiencing unpredictable digestive episodes, energy crashes, and brain fog that disrupt their carefully structured life. They feel betrayed by their body's inconsistency despite their health investments and lifestyle optimization efforts. This creates desperate urgency to regain bodily control and predictability to restore their sense of personal agency and life management.","deep_triggers":["Learned helplessness from repeated unpredictable health episodes", "Loss of internal locus of control over bodily functions", "Anxiety about body betraying them at inconvenient moments", "Perfectionist need for predictable, controlled wellness outcomes", "Identity crisis around being health-conscious yet struggling with health"],"examples":["'I do everything right but my body still betrays me at the worst possible moments'", "'I feel like I'm at war with my own digestive system and losing'", "'How can I plan anything when I never know how I'll feel hour by hour?'"],"approved_at":"2025-12-01T13:18:08.278685+00:00"}, 
 {"id":"7720832f-590e-4944-97fe-8bdd0a341230","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"b0367578-4c47-4149-87f5-492db909fcf8","pain_index":7,"name":"Peer Discovery Inadequacy","description":"Fear that other health-conscious peers will discover breakthrough solutions first, leaving them behind and exposing their inadequate health optimization strategy. They worry about losing their reputation as knowledgeable about wellness trends and being revealed as someone who talks about health more than they achieve it. This creates FOMO anxiety and urgency to find cutting-edge solutions before others do.","deep_triggers":["Social comparison anxiety within health-conscious peer groups", "Fear of losing status as the knowledgeable health person in their circle", "FOMO about emerging health technologies and solutions", "Competitive perfectionism about being first to discover effective solutions", "Identity threat to their role as health trendsetter and advisor to friends"],"examples":["'What if my biohacker friends find the perfect gut health solution while I'm still struggling?'", "'I'm supposed to be the health expert in my friend group but I feel like I'm falling behind'", "'Everyone will realize I've been giving health advice while my own health is a mess'"],"approved_at":"2025-12-01T13:18:08.278685+00:00"}, 
 {"id":"f329969d-a5fb-4faf-98e0-28354a84acc9","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"b0367578-4c47-4149-87f5-492db909fcf8","pain_index":8,"name":"Investment Justification Anxiety","description":"Mounting pressure to justify their significant health spending to partners, family, and themselves while lacking concrete results to show for their investment. They feel guilty about allocating substantial income to supplements that sit unused while struggling to demonstrate ROI on their health investments. This creates financial anxiety and relationship tension around their wellness priorities.","deep_triggers":["Guilt about spending family money on unproven health products", "Pressure to demonstrate tangible results from health investments", "Fear of partner judgment about wellness spending priorities", "Anxiety about opportunity cost of health spending versus other investments", "Need to prove their health optimization is worth the financial sacrifice"],"examples":["'My partner keeps asking why I spend so much on supplements that don't seem to work'", "'I could have put this supplement money toward our vacation fund instead'", "'I feel guilty spending $200 monthly on health products with no clear results to show'"],"approved_at":"2025-12-01T13:18:08.278685+00:00"}, 
 {"id":"176add19-d702-41d6-b265-12e1cc28e468","project_id":"17d26309-520b-45ec-b5d5-92512e2f6620","segment_id":"b0367578-4c47-4149-87f5-492db909fcf8","pain_index":9,"name":"Body Wisdom Disconnection","description":"Painful disconnection from their body's natural signals and wisdom after years of trying external solutions instead of developing internal awareness. They feel like strangers in their own body, unable to distinguish between normal sensations and warning signs, creating anxiety about their ability to self-regulate and make appropriate health decisions. This disconnection makes them doubt their capacity for natural healing and intuitive wellness.","deep_triggers":["Loss of confidence in natural body wisdom and self-regulation", "Over-reliance on external health inputs rather than internal awareness", "Anxiety about inability to interpret body signals correctly", "Fear that they've damaged their natural healing capacity through supplement dependency", "Disconnection from ancestral health wisdom and natural living"],"examples":["'I don't even know what normal digestion feels like anymore after trying so many interventions'", "'I've become so dependent on supplements that I don't trust my body to function naturally'", "'I feel disconnected from my body's natural rhythms and signals'"],"approved_at":"2025-12-01T13:18:08.278685+00:00"}]